export const RULE_CATEGORIES = [
  {
    hash: '#1',
    title: '📜 Правила спілкування на ігрових ресурсах проєкту "ARMA 3 VTG"',
  },
  {
    hash: '#2',
    title: '📜 Ієрархія зайняття слотів формату VTG та mVTG',
  },
  {
    hash: '#3',
    title: '📜  Правила Nick-Name’y',
  },
  {
    hash: '#4',
    title: '📜 Система покарань проєкту',
  },
  {
    hash: '#5',
    title: '📜 Аксесуари у профілі',
  },
  {
    hash: '#6',
    title: '📜 Ігрові правила',
  },
  {
    hash: '#7',
    title: '📜 Категорії чатів та оффтоп',
  },
  {
    hash: '#8',
    title:
      '📜 Правила командирів сторін та зайняття слотів для ротаційних загонів',
  },
];


