import { Layout } from '@/widgets/layout';
import { FC, PropsWithChildren } from 'react';

const RuleCategory: FC<PropsWithChildren> = ({ children }) => (
  <div className='flex flex-col gap-4 mt-4'>{children}</div>
);
const RuleTitle: FC<PropsWithChildren> = ({ children }) => <h3 className='text-lg font-bold pl-4'>{children}</h3>;
const RuleContent: FC<PropsWithChildren> = ({ children }) => <p className='pl-4'>{children}</p>;

const RulesPage = () => {
  return (
    <Layout className='w-full bg-card/80 mx-auto my-4 p-4 max-w-4xl'>
      <h1 className='text-2xl font-bold text-center'>Правила проекту</h1>
      <RuleCategory>
        <RuleTitle>
          📜 Правила спілкування на ігрових ресурсах проєкту "ARMA 3 VTG"
        </RuleTitle>
        <RuleContent>
          1.1. Найперше та засадниче правило поведінки на ігрових ресурсах
          проєкту "Arma 3 VTG": всі платформи, які пов'язані з проєктом VTG,
          створені для успішного та якісного проведення часу в ігровому
          симуляторі "Arma 3". Будь-які провокації, образи та інші форми
          негативного звертання до гравців, загонів, груп людей, проєкту "Arma 3
          VTG" (в тому числі й інших проєктів по Arma 3) через особисті
          відносини, неприязнь чи з іншої причини СУВОРО ЗАБОРОНЯЮТЬСЯ. Уважно
          керуйтеся цим рекомендаційним правилом при проведенні часу на ВСІХ
          ігрових ресурсах проєкту.
        </RuleContent>
        <RuleContent>
          1.2. Незнання правил не звільняє від відповідальності (це правило
          носить рекомендаційний характер і залежно від того характеру
          порушення, яке здійснив гравець проводиться покарання - від небажаного
          та ненавмисного до усвідомленого важкого шкідництва).
        </RuleContent>
        <RuleContent>
          1.3. Суворо заборонені: образи, провокації, наклеп та переслідування
          співрозмовників у будь-якій формі (текст, медіа, реакції тощо).
          Винятком може бути жартівлива форма, однак якщо це ображає
          співрозмовника, він зобов'язаний повідомити модератора та написати
          скаргу. Покарання за порушення цього правила залежать від важкості
          інциденту і можуть включати: усне попередження, обмеження в Discord,
          обмеження в ігровому TeamSpeak або заборону на участь у TVT-іграх.
        </RuleContent>
        <RuleContent>
          1.4. Забороняється розповсюдження особистих відомостей про Користувача
          без його згоди, також заборонено завуальовувати дані про користувача
          фейковими іменами, прізвищами та позивними. 1.5. Заборонено в
          образливій формі відгукуватися про інші загони. (Висловлювання в
          образливій формі проти Вашого загону не є підставою для дзеркальних
          дій у відповідь), (при покаранні гравця враховується системність
          порушення та його поведінка в межах проєкту та відділення, якого він
          учасник).
        </RuleContent>
        <RuleContent>
          1.6. Заборонено будь-які висловлювання та заклики, а також розміщення
          матеріалів, що порушують законодавство України.
        </RuleContent>
        <RuleContent>
          1.7. Дозволено розміщувати посилання на зовнішні ресурси; при
          розміщенні посилань на зовнішні ресурси користувач бере на себе повну
          відповідальність, якщо розміщена інформація порушує одне або декілька
          правил Discord.
        </RuleContent>
        <RuleContent>
          1.8. Забороняється розміщувати матеріали непристойного чи образливого
          змісту. (Непристойним змістом є нагота, еротичний або порнографічний
          контент, образливі матеріали, що принижують або висміюють осіб чи
          групи за будь-якими ознаками, жорстокий або кривавий контент із зайвою
          демонстрацією насильства, каліцтв чи тортур, пропаганда ненависті,
          дискримінації або екстремістська символіка у формі зображення, відео,
          аудіо та файлів GIF)
        </RuleContent>
        <RuleContent>
          1.9. Заборона пропаганди будь-яких ідеологій, релігій, власної думки
          тощо. Висловлювання власної думки без будь-яких закликів у різних
          формах не обмежується та захищається Конституцією України, але ви не
          можете змушувати інших до послухання цієї думки, як єдиної істинної.
        </RuleContent>
        <RuleContent>
          1.10. Особам, котрі є громадянами РФ, забороняється брати участь в
          іграх на проєкті, а також бути присутніми на всіх ресурсах проєкту
          "ARMA 3 VTG" (Особи з антиукраїнськими/проросійськими позиціями
          прирівнюються до громадян РФ). Також адміністрація дотримується
          рекомендацій місцевої влади, силових структур та центральної влади
          України про те, що російські окупанти примушують громадян отримати
          російський паспорт, бо без його наявності життя стає неможливим (це
          питання виноситься на дискурс адміністрації проєкту).
        </RuleContent>
        <RuleContent>
          1.11. Нікнейм гравця повинен бути однаковим на всіх ігрових ресурсах
          проєкту. Систематичне порушення цього правила несе за собою важке
          покарання.
        </RuleContent>
        <RuleContent>
          1.12. Дії адміністрації та керівництва проєкту не підлягають
          обговоренню на ресурсах проєкту "Arma 3 VTG".{' '}
        </RuleContent>
        <RuleContent>
          1.13. Створення твінків (нових акаунтів одним гравцем) -
          забороняється.
        </RuleContent>
        <RuleContent>
          1.14. Забороняється наклеп та неповага стосовно інших учасників
          проєкту. Спілкування між учасниками проєкту повинно відбуватись на
          основах моральних людських засад та принципах етикету. Це правило
          працює стосовно всіх АБСОЛЮТНО, ваша поведінка зараз – ставлення інших
          (адміністрації в тому числі при розгляді скарг тощо) в майбутньому.
        </RuleContent>
        <RuleContent>
          1.15. Забороняється вводити адміністрацію проєкту в оману. За
          порушення даного пункту передбачено серйозне покарання. 1.16.
          Налаштування вашого профілю в Discord, TeamSpeak, нікнейму на ігровому
          сервері Arma 3 VTG не повинні мати образливого підтексту, прямих образ
          або провокацій.
        </RuleContent>
        <RuleContent>
          1.17. Забороняється неконструктивна критика місій, яка не має на меті
          їх вдосконалення. Використання ненормативної лексики, образливих
          висловлювань або принизливих коментарів з метою образи автора чи
          учасників місій суворо заборонено. Відгуки повинні бути
          конструктивними, аргументованими та подаватися у відповідній формі.
        </RuleContent>
        <RuleContent>
          1.18. У разі виникнення непорозумінь, подвійного трактування або
          відсутності відповідних рамок, що суттєво вплинули на ігровий процес
          під час відіграшу місій через неправильне або неоднозначне сприйняття
          умовностей місії, єдине правильне трактування має бути озвучене
          карторобом.
        </RuleContent>
        <RuleContent>
          1.18.1 З метою уникнення маніпуляцій з умовностями, до розгляду таких
          ситуацій можуть бути залучені представники УВК та адміністрації.
          Картороб зобов'язаний відповідально ставитися до прийняття подібних
          рішень, уникаючи підлаштовування умовностей для отримання власної
          вигоди у спірній ситуації.
        </RuleContent>
        <RuleContent>
          1.18.2 У випадку виявлення очевидних маніпуляцій з умовностями,
          питання має виноситись на загальний розгляд представниками УВК,
          адміністрації та обраними УВК досвідченими карторобами у кількості не
          менше трьох осіб.
        </RuleContent>
        <RuleContent>
          1.18.3 Для уникнення подібних ситуацій, гравцям рекомендується
          звертатися до карторобів з проханням прояснити деталі та тлумачення
          умовностей, а також уточнити можливі сценарії, якщо це не матиме
          наслідків, що можуть вплинути на хід гри (наприклад, конфіденційність
          планування, коли картороб є учасником іншої ротаційної сторони або має
          відповідні зв'язки).
        </RuleContent>
        <RuleContent>
          1.19. Заборонено переслідування учасників команди VTG в особистих
          повідомленнях платформи Discord. 1.19.1. Під переслідуванням
          розуміється: повторювані небажані повідомлення, спрямовані на одного
          або кількох учасників команди; образи, погрози або будь-яка інша
          агресивна поведінка; вимагання дій, відповідей або рішень без згоди
          отримувача; навмисне створення дискомфорту або психологічного тиску
          через постійні звернення. 1.19.2. Дане правило діє, оскільки всі члени
          команди VTG виконують свої обов’язки у межах проєкту. 1.19.3. До
          складу команди VTG входять наступні ролі: Керівництво, Серверна
          адміністрація, Ігрова адміністрація, Технічна адміністрація,
          Управління відділу карторобів та Модерація Discord.
        </RuleContent>
      </RuleCategory>
    </Layout>
  );
};

export default RulesPage;
