import { cn } from '@/shared/utils/cn';
import { Hero } from '@/widgets/hero';
import { Layout } from '@/widgets/layout';

import { FC, PropsWithChildren } from 'react';

const RuleCategory: FC<PropsWithChildren> = ({ children }) => (
  <div className='flex flex-col gap-4 bg-card/80 py-4'>{children}</div>
);
const RuleTitle: FC<PropsWithChildren<{ id?: string }>> = ({
  children,
  id,
}) => (
  <h3 className='text-lg text-center font-bold px-4' id={id}>
    {children}
  </h3>
);
const RuleContent: FC<
  PropsWithChildren<{
    id?: string;
  }>
> = ({ children, id }) => {
  const dotCount = (id?.match(/\./g) || []).length;

  return (
    <div
      className={cn('pl-4 text-neutral-400', {
        'pl-8': dotCount === 2,
        'pl-12': dotCount === 3,
      })}
      id={id}>
      {id && (
        <a href={`#${id}`} className=' text-green-500'>
          {id}.{' '}
        </a>
      )}
      {children}
    </div>
  );
};

const RuleMenu = () => {
  const ruleCategories = [
    {
      hash: '#1',
      title: '📜 Правила спілкування на ігрових ресурсах проєкту "ARMA 3 VTG"',
    },
    {
      hash: '#2',
      title: '📜 Ієрархія зайняття слотів формату VTG та mVTG',
    },
    {
      hash: '#3',
      title: '📜  Правила Nick-Name’y',
    },
    {
      hash: '#4',
      title: '📜 Система покарань проєкту',
    },
    {
      hash: '#5',
      title: '📜 Аксесуари у профілі',
    },
    {
      hash: '#6',
      title: '📜 Ігрові правила',
    },
    {
      hash: '#7',
      title: '📜 Категорії чатів та оффтоп',
    },
    {
      hash: '#8',
      title:
        '📜 Правила командирів сторін та зайняття слотів для ротаційних загонів',
    },
  ];

  return (
    <div className='flex flex-col bg-card/80 min-w-1/4 h-fit sticky top-20 shadow-2xl max-lg:hidden'>
      <h2 className='text-lg mt-4 mb-1 font-bold text-center'>Розділи</h2>
      <div className='flex flex-col'>
        {ruleCategories.map((category) => (
          <a
            className='block p-4 hover:bg-primary/10'
            href={category.hash}
            key={category.title}>
            {category.title}
          </a>
        ))}
      </div>
    </div>
  );
};

const RulesPage = () => {
  return (
    <Layout className='w-full mx-auto '>
      <Hero />
      <h1 className='text-2xl font-bold text-center my-4'>Правила проекту</h1>
      <div className=' max-md:p-0 max-md:m-0 min-lg:container mx-auto flex gap-4'>
        <RuleMenu />
        <div className='w-full mx-auto mb-1'>
          <RuleCategory>
            <RuleTitle id='1'>
              📜 Правила спілкування на ігрових ресурсах проєкту "ARMA 3 VTG"
            </RuleTitle>
            <RuleContent id='1.1'>
              Найперше та засадниче правило поведінки на ігрових ресурсах
              проєкту "Arma 3 VTG": всі платформи, які пов'язані з проєктом VTG,
              створені для успішного та якісного проведення часу в ігровому
              симуляторі "Arma 3". Будь-які провокації, образи та інші форми
              негативного звертання до гравців, загонів, груп людей, проєкту
              "Arma 3 VTG" (в тому числі й інших проєктів по Arma 3) через
              особисті відносини, неприязнь чи з іншої причини СУВОРО
              ЗАБОРОНЯЮТЬСЯ. Уважно керуйтеся цим рекомендаційним правилом при
              проведенні часу на ВСІХ ігрових ресурсах проєкту.
            </RuleContent>
            <RuleContent id='1.2'>
              Незнання правил не звільняє від відповідальності (це правило
              носить рекомендаційний характер і залежно від того характеру
              порушення, яке здійснив гравець проводиться покарання - від
              небажаного та ненавмисного до усвідомленого важкого шкідництва).
            </RuleContent>
            <RuleContent id='1.3'>
              Суворо заборонені: образи, провокації, наклеп та переслідування
              співрозмовників у будь-якій формі (текст, медіа, реакції тощо).
              Винятком може бути жартівлива форма, однак якщо це ображає
              співрозмовника, він зобов'язаний повідомити модератора та написати
              скаргу. Покарання за порушення цього правила залежать від важкості
              інциденту і можуть включати: усне попередження, обмеження в
              Discord, обмеження в ігровому TeamSpeak або заборону на участь у
              TVT-іграх.
            </RuleContent>
            <RuleContent id='1.4'>
              Забороняється розповсюдження особистих відомостей про Користувача
              без його згоди, також заборонено завуальовувати дані про
              користувача фейковими іменами, прізвищами та позивними.
            </RuleContent>
            <RuleContent id='1.5'>
              Заборонено в образливій формі відгукуватися про інші загони.
              (Висловлювання в образливій формі проти Вашого загону не є
              підставою для дзеркальних дій у відповідь), (при покаранні гравця
              враховується системність порушення та його поведінка в межах
              проєкту та відділення, якого він учасник).
            </RuleContent>
            <RuleContent id='1.6'>
              Заборонено будь-які висловлювання та заклики, а також розміщення
              матеріалів, що порушують законодавство України.
            </RuleContent>
            <RuleContent id='1.7'>
              Дозволено розміщувати посилання на зовнішні ресурси; при
              розміщенні посилань на зовнішні ресурси користувач бере на себе
              повну відповідальність, якщо розміщена інформація порушує одне або
              декілька правил Discord.
            </RuleContent>
            <RuleContent id='1.8'>
              Забороняється розміщувати матеріали непристойного чи образливого
              змісту. (Непристойним змістом є нагота, еротичний або
              порнографічний контент, образливі матеріали, що принижують або
              висміюють осіб чи групи за будь-якими ознаками, жорстокий або
              кривавий контент із зайвою демонстрацією насильства, каліцтв чи
              тортур, пропаганда ненависті, дискримінації або екстремістська
              символіка у формі зображення, відео, аудіо та файлів GIF)
            </RuleContent>
            <RuleContent id='1.9'>
              Заборона пропаганди будь-яких ідеологій, релігій, власної думки
              тощо. Висловлювання власної думки без будь-яких закликів у різних
              формах не обмежується та захищається Конституцією України, але ви
              не можете змушувати інших до послухання цієї думки, як єдиної
              істинної.
            </RuleContent>
            <RuleContent id='1.10'>
              Особам, котрі є громадянами РФ, забороняється брати участь в іграх
              на проєкті, а також бути присутніми на всіх ресурсах проєкту "ARMA
              3 VTG" (Особи з антиукраїнськими/проросійськими позиціями
              прирівнюються до громадян РФ). Також адміністрація дотримується
              рекомендацій місцевої влади, силових структур та центральної влади
              України про те, що російські окупанти примушують громадян отримати
              російський паспорт, бо без його наявності життя стає неможливим
              (це питання виноситься на дискурс адміністрації проєкту).
            </RuleContent>
            <RuleContent id='1.11'>
              Нікнейм гравця повинен бути однаковим на всіх ігрових ресурсах
              проєкту. Систематичне порушення цього правила несе за собою важке
              покарання.
            </RuleContent>
            <RuleContent id='1.12'>
              Дії адміністрації та керівництва проєкту не підлягають обговоренню
              на ресурсах проєкту "Arma 3 VTG".{' '}
            </RuleContent>
            <RuleContent id='1.13'>
              Створення твінків (нових акаунтів одним гравцем) - забороняється.
            </RuleContent>
            <RuleContent id='1.14'>
              Забороняється наклеп та неповага стосовно інших учасників проєкту.
              Спілкування між учасниками проєкту повинно відбуватись на основах
              моральних людських засад та принципах етикету. Це правило працює
              стосовно всіх АБСОЛЮТНО, ваша поведінка зараз – ставлення інших
              (адміністрації в тому числі при розгляді скарг тощо) в
              майбутньому.
            </RuleContent>
            <RuleContent id='1.15'>
              Забороняється вводити адміністрацію проєкту в оману. За порушення
              даного пункту передбачено серйозне покарання.
            </RuleContent>
            <RuleContent id='1.16'>
              Налаштування вашого профілю в Discord, TeamSpeak, нікнейму на
              ігровому сервері Arma 3 VTG не повинні мати образливого підтексту,
              прямих образ або провокацій.
            </RuleContent>
            <RuleContent id='1.17'>
              Забороняється неконструктивна критика місій, яка не має на меті їх
              вдосконалення. Використання ненормативної лексики, образливих
              висловлювань або принизливих коментарів з метою образи автора чи
              учасників місій суворо заборонено. Відгуки повинні бути
              конструктивними, аргументованими та подаватися у відповідній
              формі.
            </RuleContent>
            <RuleContent id='1.18'>
              У разі виникнення непорозумінь, подвійного трактування або
              відсутності відповідних рамок, що суттєво вплинули на ігровий
              процес під час відіграшу місій через неправильне або неоднозначне
              сприйняття умовностей місії, єдине правильне трактування має бути
              озвучене карторобом.
            </RuleContent>
            <RuleContent id='1.18.1'>
              З метою уникнення маніпуляцій з умовностями, до розгляду таких
              ситуацій можуть бути залучені представники УВК та адміністрації.
              Картороб зобов'язаний відповідально ставитися до прийняття
              подібних рішень, уникаючи підлаштовування умовностей для отримання
              власної вигоди у спірній ситуації.
            </RuleContent>
            <RuleContent id='1.18.2'>
              У випадку виявлення очевидних маніпуляцій з умовностями, питання
              має виноситись на загальний розгляд представниками УВК,
              адміністрації та обраними УВК досвідченими карторобами у кількості
              не менше трьох осіб.
            </RuleContent>
            <RuleContent id='1.18.3'>
              Для уникнення подібних ситуацій, гравцям рекомендується звертатися
              до карторобів з проханням прояснити деталі та тлумачення
              умовностей, а також уточнити можливі сценарії, якщо це не матиме
              наслідків, що можуть вплинути на хід гри (наприклад,
              конфіденційність планування, коли картороб є учасником іншої
              ротаційної сторони або має відповідні зв'язки).
            </RuleContent>
            <RuleContent id='1.19'>
              Заборонено переслідування учасників команди VTG в особистих
              повідомленнях платформи Discord.
            </RuleContent>
            <RuleContent id='1.19.1'>
              Під переслідуванням розуміється: повторювані небажані
              повідомлення, спрямовані на одного або кількох учасників команди;
              образи, погрози або будь-яка інша агресивна поведінка; вимагання
              дій, відповідей або рішень без згоди отримувача; навмисне
              створення дискомфорту або психологічного тиску через постійні
              звернення.
            </RuleContent>
            <RuleContent id='1.19.2'>
              Дане правило діє, оскільки всі члени команди VTG виконують свої
              обов’язки у межах проєкту.
            </RuleContent>
            <RuleContent id='1.19.3'>
              До складу команди VTG входять наступні ролі: Керівництво, Серверна
              адміністрація, Ігрова адміністрація, Технічна адміністрація,
              Управління відділу карторобів та Модерація Discord.
            </RuleContent>
          </RuleCategory>

          <RuleCategory>
            <RuleTitle id='2'>
              📜 Ієрархія зайняття слотів формату VTG та mVTG
            </RuleTitle>
            <RuleContent id='2.1.1'>ІА – Ігровий Адміністратор</RuleContent>

            <RuleContent id='2.1.2'>
              КС – Командир Сторони (найвищий слот на стороні)
            </RuleContent>
            <RuleContent id='2.1.2.1'>
              Займати слоти без КС заборонено. (Винятком є заброньовані слоти
              ротаційним загоном)
            </RuleContent>
            <RuleContent id='2.1.3'>
              КВ – Командир Відділення (найвищий слот у кожному відділенні)
            </RuleContent>
            <RuleContent id='2.1.3.1'>
              Займати слоти без КВ заборонено. (Винятком є заброньовані слоти
              ротаційним загоном)
            </RuleContent>
            <RuleContent id='2.2'>На TvT (1-2 гра):</RuleContent>
            <RuleContent id='2.2.1'>
              Вхід на сервер тільки для відділень, зареєстрованих на проєкті.
            </RuleContent>
            <RuleContent id='2.2.2'>Вхід на сервер одинакам.</RuleContent>

            <RuleContent id='2.3.1'>
              Вхід дозволяється на будь-який вільний слот, при проханні КВ -
              звільнити його.
            </RuleContent>
            <RuleContent id='2.4'>
              Послідовність для заняття слотів:
            </RuleContent>
            <RuleContent id='2.4.1'>
              Зайти на сервер за командою ІА чи іншого адміністратора.
            </RuleContent>
            <RuleContent id='2.4.2'>
              Зайняти слот, який був заброньований КВ в таблиці.
            </RuleContent>
            <RuleContent id='2.4.3'>
              Для одинаків: запитати дозволу у КВ щодо заняття слота.
            </RuleContent>
            <RuleContent id='2.4.4'>
              Після старту на брифінг КВ повинні перейти до каналу свого штабу
              (синій/червоний).
            </RuleContent>

            <RuleContent id='2.5.1'>
              Під час зміни або встановлення карти, а також при технічних
              проблемах з ігровим сервером.
            </RuleContent>
            <RuleContent id='2.5.2'>
              Ігровий Адміністратор, що знаходиться на сервері, повинен
              оголошувати в TeamSpeak про кожен етап адміністрування гри.
            </RuleContent>
            <RuleContent id='2.5.3'>
              Заборонено вхід на слот після старту на брифінг без згоди КВ.
            </RuleContent>
            <RuleContent id='2.5.4'>
              Заборонено вхід в чужого/пустого бота після старту на фрізтайм.
            </RuleContent>
            <RuleContent id='2.5.5'>
              Зміна/заняття слотів після закінчення фрізтайму забороняється.
            </RuleContent>
            <RuleContent id='2.5.6'>
              Заборонено перезахід за іншого бота після смерті.
            </RuleContent>

            <RuleContent id='2.5.7'>
              Гравцям одного відділення заборонено займати слоти по обидві
              протиборчі сторони.
            </RuleContent>
          </RuleCategory>

          <RuleCategory>
            <RuleTitle id='3'>📜 Правила Nick-Name’y</RuleTitle>

            <RuleContent id='3.1'>
              Правила та рекомендації щодо вибору &quot;nickname&quot;. При
              виборі &quot;nickname&quot; керуйтеся здоровим глуздом. Уявіть
              себе на місці тих, хто буде до вас звертатися.
            </RuleContent>

            <RuleContent id='3.1.1'>
              &quot;Nickname&quot; не повинен складатися з трьох і більше слів,
              які не мають логічного зв'язку між собою. (Допускається
              використання максимум двох слів.)
            </RuleContent>

            <RuleContent id='3.1.2'>
              &quot;Nickname&quot; повинен повністю складатися або з кирилиці,
              або з латиниці. Комбінувати символи з різних алфавітів заборонено.
              Приклади заборонених нікнеймів: Super Снайпер, Чудо Medic,
              Кримський Bridge, AeroДром, mr.Танк.
            </RuleContent>

            <RuleContent id='3.1.3'>
              &quot;Nickname&quot; не повинен бути назвою військової техніки,
              зброї (включаючи військовий жаргон), військових об'єктів, ролей у
              підрозділах або об'єктів на карті. Це може спричинити плутанину
              під час радіопереговорів. Приклади заборонених нікнеймів:
              <ul className='list-disc list-inside ml-4'>
                <li>Супер Снайпер</li>
                <li>Чудо Медик</li>
                <li>Кримський Міст</li>
                <li>AeroДром</li>
                <li>Містер ТАНК</li>
                <li>GPS228</li>
              </ul>
              (Усі випадки розглядаються індивідуально, можливі винятки.)
            </RuleContent>

            <RuleContent id='3.1.4'>
              &quot;Nickname&quot; не повинен містити нецензурну чи образливу
              лексику, зачіпати релігійні або патріотичні почуття, містити
              пропаганду, рекламу чи матеріали, що порушують законодавство
              України.
            </RuleContent>

            <RuleContent id='3.1.5'>
              Заборонено використовувати &quot;nickname&quot;, який ідентичний
              уже зареєстрованим нікнеймам або назвам загонів на проєкті. Схожі
              за звучанням нікнейми не заборонені, але не вітаються. Для
              перевірки унікальності &quot;nickname&quot; можна скористатися
              пошуком серед верифікованих гравців у Discord.
            </RuleContent>

            <RuleContent id='3.2'>
              Використання тегів загонів Кожен учасник загону зобов'язаний
              розміщувати тег загону безпосередньо перед своїм нікнеймом,
              розділяючи їх рівно одним пробілом. Назва загону має містити
              виключно символи одного алфавіту – або тільки кирилицю, або тільки
              латиницю.
            </RuleContent>

            <RuleContent id='3.2.1'>
              Єдиним стандартом написання тегів загону є наступні формати: • Для
              учасника загону: [&quot;Назва загону&quot;] &quot;nickname&quot; •
              Для курсанта загону: [~&quot;Назва загону&quot;~]
              &quot;nickname&quot; Приклади: • Учасник загону: [MOLT] Гризун •
              Курсант загону: [~RGE~] Nikita
            </RuleContent>

            <RuleContent id='3.3'>
              Якщо &quot;nickname&quot; порушує правила, адміністрація залишає
              за собою право застосовувати санкції, аж до перманентного
              блокування на серверах спільноти.
            </RuleContent>

            <RuleContent id='3.3.1'>
              Якщо ваш &quot;nickname&quot; заблокували або ви просто хочете
              його змінити, виконайте наступні кроки: Зайдіть у Discord проєкту.
              Перейдіть у канал &quot;Звернення до адміністрації&quot;. Зробіть
              запит на зміну &quot;nickname&quot; на новий, який відповідає
              правилам.
            </RuleContent>

            <RuleContent id='3.3.2'>
              Адміністрація залишає за собою право заборонити будь-який
              &quot;nickname&quot; без пояснення причин.
            </RuleContent>
          </RuleCategory>

          <RuleCategory>
            <RuleTitle id='4'>📜 Система покарань проєкту </RuleTitle>
            <div className='p-4'>
              На ресурсах проєкту "ARMA 3 VTG" діє система покарань за проступки
              різної важкості. Докази на правопорушення, які і самі
              правопорушення мають свій термін придатності. Цей термін
              визначається одним робочим тижнем протяжністю в 10 діб (240 годин
              з моменту порушення). Цей час відводиться Вам на те, щоб подати
              скаргу. Більш важкі порушення та докази можуть розглядатись
              незалежно від цього терміну.
            </div>

            <RuleContent id='4.1'>
              RO (з англ. Read Only, тимчасове блокування можливості відправляти
              повідомлення в каналі Discord). Видається за прямі, завуальовані
              та іншого характеру/змісту образи, флуд, оффтоп, аморальні
              фото/відео, порнографія тощо. RO видається на різні проміжки часу
              в залежності від важкості порушення. Термін видачі RO
              обговорюється адміністрацією проєкту.
            </RuleContent>

            <RuleContent id='4.2'>
              Warn (з англ. Warning, попередження). Видається за порушення
              правил поведінки на ресурсах проєкту "ARMA 3 VTG". За легкі
              порушення Ви отримуєте письмове попередження. При отриманні 3/3
              попереджень Ви отримаєте RO та відсторонення від участі на іграх
              проєкту VTG на 7 днів або інший термін, який визначає
              адміністрація в залежності від важкості порушень. Одне письмове
              попередження видається терміном на 30 днів.
            </RuleContent>

            <RuleContent id='4.3'>
              Ban (з англ. Block, блокування). Бан видається у найбільш грубих
              порушеннях правил "ARMA 3 VTG" та неадекватної поведінки гравця.
              Бан видається терміном від 7 днів на всіх ресурсах проєкту "ARMA 3
              VTG". За більш важкі проступки або повторні навмисні порушення
              видається перманентний бан.
            </RuleContent>

            <RuleContent id='4.4'>
              Усі відділення несуть відповідальність за своїх гравців. В
              особливо важких випадках, пеналізація різного ступеня може бути
              застосована проти всього відділення. В найгіршому випадку
              відділення буде розформовано, а всі гравці будуть перманентно
              забанені на проєкті та всіх його ресурсах.
            </RuleContent>

            <RuleContent id='4.5'>
              Адміністрація не зобов'язана пред'являти або публікувати докази
              правопорушень.
            </RuleContent>

            <RuleContent id='4.6'>
              Адміністрація залишає за собою право на зміну терміну покарань та
              причин блокування в залежності від порушень.
            </RuleContent>
          </RuleCategory>

          <RuleCategory>
            <RuleTitle id='5'>📜 Аксесуари у профілі</RuleTitle>
            <div className='p-4'>
              Гравцям заборонено використовувати на іграх у налаштуваннях
              профілю наступні види очків:
            </div>

            <RuleContent id='5.1'>Всі види протигазів.</RuleContent>
            <RuleContent id='5.2'>Наколінники з моди DHI.</RuleContent>
            <RuleContent id='5.3'>
              Респіраторні маски із DLC Laws of War.
            </RuleContent>
            <RuleContent id='5.4'>Пов'язки на очі.</RuleContent>
            <RuleContent id='5.5'>
              Балаклави з активними навушниками.
            </RuleContent>
            <RuleContent id='5.6'>
              Балаклави APEX, які приховують обличчя в тепловізорі.
            </RuleContent>
          </RuleCategory>

          <RuleCategory>
            <RuleTitle id='6'>📜 Ігрові правила</RuleTitle>

            <RuleContent id='6.1'>
              Заборонено вбивство союзних гравців і вбивство ботів на респавні,
              за винятком будь-якого бага, який виник та вимагає умертвіння
              бота.
            </RuleContent>

            <RuleContent id='6.2'>
              Заборонено використання недопрацювань у місіях, недоробок, багів
              гри, об'єктів текстур, клонування (дюп) спорядження тощо.
            </RuleContent>

            <RuleContent id='6.3'>
              Заборонено самовільне покидання техніки, ящиків та іншого,
              приписаного загонам без дозволу КС, КЗ цих загонів.
            </RuleContent>

            <RuleContent id='6.4'>
              Заборонено порушення ігрових умовностей місії (вказані у
              брифінгу), навіть якщо ці умовності не перевіряються скриптами та
              тригерами.
            </RuleContent>

            <RuleContent id='6.5'>
              Заборонено флуд в ігровому чаті та на карті (зайві мітки, написи,
              малюнки тощо).
            </RuleContent>

            <RuleContent id='6.6'>
              Заборонено використання сторонніх каналів зв'язку під час гри
              (skype, steam, icq, raid call тощо). Винятками є діалог, що не
              належать до ігрового процесу, або діалог, викликаний необхідністю
              повідомити про технічні неполадки під час гри (вилетів з сервера,
              відключився інтернет і т.п.). Якщо всі сторони діалогу мертві на
              місії, яка ще не завершилася, на них пункт правил не поширюється.
            </RuleContent>

            <RuleContent id='6.7'>
              Заборонено безвідповідальне ставлення при керуванні бойовим або
              транспортним засобом, що зазнало зриву плану командира сторони.
            </RuleContent>

            <RuleContent id='6.7.1'>
              Заборонено безвідповідальне ставлення до особистого озброєння, яке
              призвело до ураження союзних сил.
            </RuleContent>

            <RuleContent id='6.8'>
              Заборонено навмисний таран техніки. Винятком є гравець, який
              використовує можливість само підриву після смерті (кнопка мерця і
              т.д.).
            </RuleContent>

            <RuleContent id='6.8.1'>
              Якщо автору місії з якихось причин буде необхідний таран на місії,
              він повинен описати це в умовностях (має бути вагома причина).
            </RuleContent>

            <RuleContent id='6.9'>
              Гравцям заборонено додавати/видозмінювати моди/пресет та
              використовувати стороннє програмне забезпечення (чіти).
            </RuleContent>

            <RuleContent id='6.10'>
              При умовності відсутності балансу на ігрових місіях адміністратор
              залишає за собою право пересаджувати певні відділення
              (Пересаджувати відділення частково - заборонено), одинаків, на
              інші слоти.
            </RuleContent>

            <RuleContent id='6.11'>
              Відповідно до таблиці Командирів сторони, загони зобов'язанні
              займати відділення, що виділенні карторобом для КС.
            </RuleContent>

            <RuleContent id='6.12'>
              Заборонено флудити в рації КХ та ДХ.
            </RuleContent>

            <RuleContent id='6.13'>
              Заборонено переходити на КХ іншого відділення без дозволу чи
              поважної на то причини, наприклад, смерть КЗ чи всього відділення,
              тощо.
            </RuleContent>

            <RuleContent id='6.14'>
              Командування стороною може здійснювати тільки зі слота КСа.
            </RuleContent>

            <RuleContent id='6.15'>
              Послухання в рамках ігор TVT відбувається згідно військової
              ієрархії (командири сторін ведуть управління операцією на
              стратегічному та тактичному рівні, командири окремих підрозділів
              ведуть тактичне управління відділення та підкоряються КСу, бійці
              підрозділів підкоряються своєму безпосередньому командиру та КСу в
              тому числі).
            </RuleContent>

            <RuleContent id='6.16'>
              Заборонено виставляти будь-який контент з гри на ресурсах проєкту,
              якщо місія звідки цей контент взятий ще не завершилась.
            </RuleContent>

            <RuleContent id='6.17'>
              Відтворення музики або звуків, які не заборонені правилами проєкту
              не забороняється лише в жартівних цілях у Вашому підрозділі або за
              його межами за відсутності докору інших гравців. Коли від Вас
              вимагатимуть негайно виключити звукове відтворення за об'єктивної
              причини - Ви повинні підкоритись.
            </RuleContent>

            <RuleContent id='6.18'>
              Забороняється проявляти будь-яку потенційно шкідливу діяльність на
              фріз-таймі (стрільба, використання гранат тощо).
            </RuleContent>

            <RuleContent id='6.19'>
              Заборонено створювати зайві шуми та заважати під час збору в
              TeamSpeak та під час гри.
            </RuleContent>

            <RuleContent id='6.20'>
              Заборонено писати в чаті лобі не по темі (КС, КВ можуть писати по
              темі слотингу).
            </RuleContent>

            <RuleContent id='6.21'>
              Під час проведення TVT ігор всі гравці повинні підкорятись
              вказівкам Ігрового Адміністратора, щоб той зміг реалізувати якісне
              проведення місії.
            </RuleContent>

            <RuleContent id='6.22'>
              Ігнорування вказівок адміністратора карається.
            </RuleContent>

            <RuleContent id='6.23'>
              Забороняється ураження точок респауна обох сторін протягом 5
              хвилин після старту місії (тобто по завершенню фрізтайму). Якщо це
              буде аргументовано умовностями місії, то обстріл дозволяється.
              [Зоною респауна є територія радіусом в 200 метрів від точки появи
              підрозділу].
            </RuleContent>

            <RuleContent id='6.24'>
              Заборонено будь-які баги з використанням ботів гравцем при
              проведенні місії (управління технікою тощо).
            </RuleContent>

            <RuleContent id='6.25'>
              Заборонено знаходитись в обмежувальних маркерах, якщо карторобом
              не вказано зворотнє.
            </RuleContent>

            <RuleContent id='6.26'>
              Заборонено саботувати ігровий процес.
            </RuleContent>

            <RuleContent id='6.27'>
              Заборонено будь-яким чином взаємодіяти зі спорядженням, технікою
              та станковим озброєнням яке приписане до інших відділень (стоїть
              поряд/навпроти місця спавну відділення) без згоди КВ.
            </RuleContent>

            <RuleContent id='6.28'>
              Заборонено мінування основних цілей (тригерів, маркерів тощо)
              засобами враження з нажимною дією (ПП/ПТ міни, розтяжки тощо).
              Винятком є вибухівка з ручним способом ініціації (Таймер, підривач
              тощо).
            </RuleContent>

            <RuleContent id='6.29'>
              Заборонено блокувати, барикадувати понад 50% входів в приміщення.
              (Будівлі тригерів, основні цілі, любі будівлі в яких знаходиться
              гравець). Будь-який гравець має вільно проходити не використовуючи
              функцію подолання перешкоди, або прямої взаємодії з об'єктом для
              його усунення зі шляху. У випадку не парної кількості входів
              завжди рахувати кількість вільних проходів у більшу сторону (З
              трьох входів блокувати можна один, з п'ятьох тільки два тощо).
              Вікна, балкони та штучні отвори - входом не рахуються.
            </RuleContent>

            <RuleContent id='6.30'>
              Гравець зобов'язаний бути присутнім в каналах ТС під час гри, фаз
              брифінгу та фріз-тайму.
            </RuleContent>

            <RuleContent id='6.31'>
              Заборонено викрадати союзну техніку, яку позначено на мапі білим
              маркером. У разі крайньої потреби потрібно зв'язатись з КВ/суб'єкт
              що виконує обов'язки КВ до якого приписана техніка та попросити
              дозволу.
            </RuleContent>

            <RuleContent id='6.32'>
              Заборонено споруджувати окопи на дорогах.
            </RuleContent>

            <RuleContent id='6.33'>
              Заборонено використовувати ігрові механіки для зайняття позицій на
              деревах, кущах та інших об'єктах, перебування на або в яких
              суперечить законам фізики та здоровому глузду. Це включає, але не
              обмежується: зависання у повітрі, проходження крізь текстури,
              перебування всередині об'єктів, які не передбачають такої
              можливості, та інші подібні випадки.
            </RuleContent>

            <RuleContent id='6.34'>
              Протягом перших 7 хвилин після початку місії заборонено відкривати
              вогонь зі зброї, що не має артилерійських таблиць, по заздалегідь
              відомих позиціях, маршрутах руху ворога або координатах, без
              підтвердження контакту.
            </RuleContent>

            <RuleContent id='6.34.1'>
              Дозвіл на вогонь надається лише при наявності візуального або
              звукового контакту, підтвердженого юнітом, що відкриває вогонь,
              або його союзниками (із передачею інформації через мітку на
              карті).
            </RuleContent>

            <RuleContent id='6.34.2'>
              У разі скарги кожен інцидент розглядається окремо з перевіркою
              наявності підтвердження контакту (відео або ОКАП). Ураження
              вважається легітимним лише за наявності такого підтвердження.
            </RuleContent>

            <RuleContent id='6.35'>
              Заборонено змінювати елементи екіпірування на ворожі (Головні
              убори, шоломи, бронежилети, РПС, аксесуари тощо), якщо інше не
              передбачено умовностями місії. Зброя, прилади та ранці не
              вважаються такими елементами.
            </RuleContent>
            <RuleContent id='6.36'>
              Заборонено покидати межі мапи. Виняток становлять усі типи БПЛА,
              авіаційна техніка, а також екіпажі та пасажири, що перебувають на
              борту. Якщо інше не передбачено умовностями місії, встановленими
              карторобом.
            </RuleContent>
          </RuleCategory>

          <RuleCategory>
            <RuleTitle id='7'>📜 Категорії чатів та оффтоп</RuleTitle>
            <RuleContent id='7.1'>
              Чати розподіляються на тематичні, кожен чат має свої обмеження в
              інформації, зміст повідомлення має відповідати категорії чату.
            </RuleContent>

            <RuleContent id='7.2'>
              Флуд - чат створений для комунікації між гравцями, на будь-які
              вільні теми, що не порушують правила ресурсів проєкту.
            </RuleContent>

            <RuleContent id='7.3'>
              Основний - чат створений для комунікації між учасниками спільноти,
              на теми які прямо належать до проєкту.
            </RuleContent>

            <RuleContent id='7.4'>
              Меми - чат створений для комунікації між учасниками спільноти,
              направлений на розважальний контент, що не суперечить правилам
              сервера.
            </RuleContent>

            <RuleContent id='7.5'>
              Медіа - чат створений для комунікації та публікації медіаконтенту
              який стосується АРМА 3 та проєкту VTG, що не суперечить правилам
              сервера.
            </RuleContent>

            <RuleContent id='7.6'>
              Звернення до адміністрації - чат створений для комунікації з
              адміністрацією проєкту.
            </RuleContent>

            <RuleContent id='7.7'>
              Відгуки ігор - чат створений для того, щоб гравці могли залишити
              об'єктивну оцінку місії (важливо уточнити, що саме технічної місії
              без врахування особливостей командування сторони, підрозділів і
              так далі). (Форма заповнення відгуків є в закріплених
              повідомленнях)
            </RuleContent>

            <RuleContent id='7.8'>
              Скарга гравців - чат створений для того, щоб гравець при
              необхідності міг залишити скаргу на іншого гравця за порушення
              правил проєкту. Будь-якому іншому гравцю (окрім потерпілого та
              обвинуваченого) заборонено приймати, в ній участь.
            </RuleContent>

            <RuleContent id='7.9'>
              Інші ігри - чат створений для того, щоб гравці ділились контентом,
              який не пов'язаний за АРМА 3 або проєктом VTG.
            </RuleContent>

            <RuleContent id='7.10'>
              В таких чатах, як “медіа”, "звернення до адміністрації", "скарга
              на гравців", "відгуки ігор" будь-які публікації мають
              обговорюватись через створення гілки до оригінального
              повідомлення.
            </RuleContent>

            <RuleContent id='7.10.1'>
              В чаті "звернення до адміністрації", якщо гравець ставить питання
              адміністрації та веде з ним бесіду через гілку, то будь-якому
              іншому гравцю заборонено приймати, а ній участь.
            </RuleContent>

            <RuleContent id='7.11'>
              Порушення правил категорії чату, карається РО на термін, який
              присуджує адміністрація.
            </RuleContent>
          </RuleCategory>

          <RuleCategory>
            <RuleTitle id='8'>
              📜 Правила командирів сторін та зайняття слотів для ротаційних
              загонів
            </RuleTitle>

            <RuleContent id='8.1'>
              На проєкті “Arma 3 VTG” працює система Командирів сторін, де
              ротаційні загони мають можливість та право командувати сторонами
              на місіях відповідно до складених завчасно списків КСів.
            </RuleContent>

            <RuleContent id='8.2'>
              Під терміном “ротаційних загонів” станом на зараз ми розуміємо ті,
              які були внесені керівництвом до списку КСів та відповідний
              ротаційних сторін для участі на іграх TVT.
            </RuleContent>

            <RuleContent id='8.3'>
              Щоб потрапити до списку ротаційних загонів, потрібно стабільно
              відвідувати місії протягом місяця, показуючи явку, проявляти
              ініціативу та усіляко брати участь у житті проєкту.
            </RuleContent>

            <RuleContent id='8.4'>
              Список може складатись на розсуд Керівництва проєкту власноруч або
              за допомогою вибірки ШІ та у випадку необхідності з додатковою
              корекцією адміністрацією.
            </RuleContent>

            <RuleContent id='8.5'>
              Командири сторін повинні за умов публікації таблиць місій на
              тиждень (заздалегідь опублікованих таблиць / запізнення публікації
              таблиць) готувати попередні плани на місію з оглядом самих місій,
              щоб на брифінгу оперативно роздати накази відділенням. Планування
              повинне складатись відповідно до норм, які не відносяться до
              неадекватних по суті (тупо штурм трігера, валіть м’ясом сюди
              тощо).
            </RuleContent>

            <RuleContent id='8.6'>
              У разі невиконання ротаційним загоном своїх обов'язків (Підготовка
              планів, відвідування дебрифінгів, явка на місії від 5 людей)
              видається попередження строком на місяць. 3 попередження - у
              ротаційного загону пропадає можливість бронювати слоти. Такий
              загін отримує слоти за залишковим принципом.
            </RuleContent>

            <RuleContent id='8.7'>
              Для уникнення пеналізації варто попередити про неявку заздалегідь.
              (Кількість таких випадків є обмеженою, і має бути з поважних
              причин.)
            </RuleContent>

            <RuleContent id='8.7.1'>
              Брифінги мають право відвідувати лише командирів відділень /
              техніки (якщо відділення спільне, то командир піхотного підрозділу
              + командир техніки).
            </RuleContent>

            <RuleContent id='8.8'>
              Командир відділень повинні дотримуватись наказів Командира сторони
              при відігріванні місії. Під час брифінгу Ви можете пропонувати
              власний розвиток планування, але якщо Командир сторони залишиться
              при своїй думці (це його право) – підкорятись.
            </RuleContent>

            <RuleContent id='8.9'>
              Командири повинні проставляти на свій підрозділ мітки (за
              наявності проставляти також мітки спостерігачів, окремих бойових
              груп тощо). Мітки потрібно актуалізувати чим частіше. Мітки
              повинні бути складені наступним чином: [Назва загону] номер
              відділення, назва техніки / класу техніки (якщо така техніка
              підтримки у вас), (наприклад: [ATT] 1-1 [ATT] 1-1, MRAP/M113
              (MK19)).
            </RuleContent>

            <RuleContent id='9.1'>
              Відділення зобов'язані відвідувати дебрифінги.
            </RuleContent>

            <RuleContent id='9.2'>
              КС має право формувати сторону на свій розсуд.
            </RuleContent>
          </RuleCategory>
        </div>
      </div>
    </Layout>
  );
};

export default RulesPage;
